app/views/stores/registrations/edit.html.erb


        <%= fields_for Address.find_by_store_id(current_store.id) do |a| %>
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 1 LIMIT 1


          <% FormOfPayment.all.each do |fp| %>
---
SELECT `form_of_payments`.* FROM `form_of_payments`

                contem_form_of_payment = false
                current_store.form_of_payment_of_stores.each { |form_of_payment_of_stores|
---
SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1