app/views/sale_store/show.html.erb

SELECT `sale_products`.* FROM `sale_products` WHERE `sale_products`.`sale_id` = 1
---
        <% quantity = 0 %>
        <% @sale.sale_products.each do |sale_product| %>