app/views/stores/show.html.erb

SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1
---
        <strong>Formas De Pagamento:</strong>
        <% @store.form_of_payment_of_stores.each do |form_of_payment_of_store| %>