app/controllers/clients_sessions_controller.rb

SELECT  `clients`.* FROM `clients` WHERE `clients`.`email` = 'robertimtoc@gmail.com' LIMIT 1
UPDATE `clients` SET `last_sign_in_at` = '2015-11-29 02:08:24', `current_sign_in_at` = '2015-11-29 02:08:24', `last_sign_in_ip` = '192.168.1.3', `current_sign_in_ip` = '192.168.1.3', `sign_in_count` = 1, `updated_at` = '2015-11-29 02:08:24' WHERE `clients`.`id` = 1
---
	def create
	    @client_password = params[:client][:password]
	    @client_email = params[:client][:email]
	    @client = @client_email.present? && Client.find_by(email: @client_email)

	    if @client.valid_password? @client_password
	      	sign_in @client, store: false
	      	@client.generate_authentication_token!
	      	@client.save

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `auth_token` = 'C8ac2wE4mx1y_uJ_8arP', `updated_at` = '2015-11-29 02:24:35' WHERE `clients`.`id` = 1
---
	def destroy
	  	@client = Client.find(params[:id])
	    @client.generate_authentication_token!
	    @client.save