app/controllers/clients_controller.rb

	def create
	#   super
    #INSERT INTO
    @client = Client.new(name: params[:client][:name], telephone: params[:client][:telephone],
    					           birth_date: params[:client][:birth_date], email: params[:client][:email],
                       	 password: params[:client][:password])
    @client.decode_cover_image_data(params[:client][:photo])

    if @client.save
      address = @client.addresses.new(country: params[:address][:country],
                                      state: params[:address][:state],
                                      city: params[:address][:city],
                                      district: params[:address][:district],
                                      street: params[:address][:street],
                                      number: params[:address][:number],
                                      cep: params[:address][:cep],
                                      complement: params[:address][:complement],
                                      full_address: params[:address][:full_address],
                                      latitude: params[:address][:latitude],
                                      longitude: params[:address][:longitude])
      address.save
---
INSERT INTO `clients` (`name`, `telephone`, `birth_date`, `cpf`, `email`, `encrypted_password`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `created_at`, `updated_at`, `auth_token`) VALUES ('Roberto Carneiro', '(85)96984883', '1990-10-17 03:00:00', '05725139336', 'robertimtoc@gmail.com', '$2a$10$M84XD4qEq82/kI.ju/nKDuWMDc9JycVSZUV.qFgnFod91ZqUc2ATm', 'profile.png', 'image/png', 88195, '2015-11-29 02:08:23', '2015-11-29 02:08:23', '2015-11-29 02:08:23', 'nr4wBwuHiiJC3qiUqKyM')
INSERT INTO `addresses` (`country`, `state`, `city`, `district`, `street`, `number`, `cep`, `complement`, `full_address`, `latitude`, `longitude`, `client_id`, `created_at`, `updated_at`) VALUES ('Brasil', 'CE', 'Fortaleza', 'Damas', 'Rua Matos Vasconcelos', '850', '60426-105', '', '850 Rua Matos Vasconcelos Damas, Fortaleza, CE 60426-105, Brasil', -3.752985, -38.55212, 1, '2015-11-29 02:08:24', '2015-11-29 02:08:24')

  def update
  #   super
    @client = current_client_json
    current_password = params[:client][:current_password]
    if Client.find(@client.id).valid_password?(current_password)
      @client.decode_cover_image_data(params[:client][:photo])
      if @client.update(name: params[:client][:name], telephone: params[:client][:telephone],
    					          birth_date: params[:client][:birth_date], email: params[:client][:email],
                        password: params[:client][:password])
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `photo_file_size` = 94994, `photo_updated_at` = '2015-11-29 02:47:58', `photo_file_name` = 'profile.png', `birth_date` = '2015-07-28 03:00:00', `encrypted_password` = '$2a$10$Peagk15cXHLGW2D1RNFYPOSA6juK1fqo8Q0L6inq8q1K1layH/TD6', `updated_at` = '2015-11-29 02:47:58' WHERE `clients`.`id` = 3