app/controllers/on_sale_percentages_controller.rb

SELECT `on_sale_percentages`.* FROM `on_sale_percentages` WHERE (date_limit > '2015-11-23 17:37:05.646710')
---
	def index
    	@on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now).destroy_all

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `store_products`.* FROM `store_products` WHERE `store_products`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `store_products` INNER JOIN `stores` ON `stores`.`id` = `store_products`.`store_id` WHERE `stores`.`id` = 1 AND (on_sale_percentage_id is not null)
---
	def new
		begin
	        @store_product = StoreProduct.find(params[:store_product_id])
	    rescue ActiveRecord::RecordNotFound => e
	        @store_product = nil
	    end
	    if @store_product == nil
	    	redirect_to store_products_path, alert: "Não existe nenhum produto com esse id na loja"
	    	return
	    end
	    numeroDePromocoesDaLoja = StoreProduct.joins(:store).where(stores:{id:@store_product.store.id}).where("on_sale_percentage_id is not null").count

SELECT  `store_products`.* FROM `store_products` WHERE `store_products`.`id` = 2 LIMIT 1
INSERT INTO `on_sale_percentages` (`percentage`, `title`, `date_limit`, `created_at`, `updated_at`) VALUES (50.0, 'METADE DO PREÇO', '2015-11-27 01:00:00', '2015-11-22 18:58:22', '2015-11-22 18:58:22')
UPDATE `store_products` SET `on_sale_percentage_id` = 1, `updated_at` = '2015-11-22 18:58:22' WHERE `store_products`.`id` = 2
---
	def create
		date_limit = params[:on_sale_percentage][:date_limit]
		hour_limit = params[:hour_limit]
		date = "#{date_limit} #{hour_limit}"
		if date.to_time < Time.now
			redirect_to new_on_sale_percentage_path(store_product_id: params[:on_sale_percentage][:store_product_id]), alert: "Erro ao Criar a promoção, Data Já Passou!"
			return
		end

		@on_sale_percentage = OnSalePercentage.new(percentage: params[:on_sale_percentage][:percentage],
												   title: params[:on_sale_percentage][:title],
												   date_limit: date)
		@store_product = StoreProduct.find(params[:on_sale_percentage][:store_product_id])
		if @on_sale_percentage.save
			@store_product.on_sale_percentage = @on_sale_percentage
			@store_product.update(on_sale_percentage_id: @on_sale_percentage.id)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `store_products`.* FROM `store_products` WHERE `store_products`.`id` = NULL LIMIT 1
---
	def edit
		begin
	        @store_product = StoreProduct.find(params[:id])

SELECT  `on_sale_percentages`.* FROM `on_sale_percentages` WHERE `on_sale_percentages`.`id` = 1 LIMIT 1
SELECT  `store_products`.* FROM `store_products` WHERE `store_products`.`id` = 2 LIMIT 1
UPDATE `on_sale_percentages` SET `percentage` = 50.0, `date_limit` = '2015-11-26 22:00:00', `updated_at` = '2015-11-22 19:34:38' WHERE `on_sale_percentages`.`id` = 1
---
	def update
		@store_product = StoreProduct.find(params[:on_sale_percentage][:store_product_id])
		if @store_product.store != current_store
	    	redirect_to store_products_path, alert: "Esse produto nao é seu"
	    	return
	    end
		date_limit = params[:on_sale_percentage][:date_limit]
		hour_limit = params[:hour_limit]
		date = "#{date_limit} #{hour_limit}"
		if date.to_time < Time.now
			redirect_to edit_on_sale_percentage_path(@store_product), alert: "Erro ao Editar a promoção, Data Já Passou!"
			return
		end

		@on_sale_percentage = OnSalePercentage.find(params[:id])
		if @on_sale_percentage.update(percentage: params[:on_sale_percentage][:percentage],
								      title: params[:on_sale_percentage][:title],
								      date_limit: date)