app/controllers/products_controller.rb

  def show
    begin
      @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1

  def edit
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1

  def create
    #INSERT INTO
    photo = params[:product][:photo]
    @product = Product.new(name: params[:product][:name], type_of_suplement: params[:product][:type_of_suplement],
                           benefits: params[:product][:benefits],
                           contraindication: params[:product][:contraindication], brand: params[:product][:brand],
                           weight: params[:product][:weight], type_of_state: params[:product][:type_of_state],
                           desc: params[:product][:desc], photo: photo)

    if @product.save
---
INSERT INTO `products` (`name`, `type_of_suplement`, `benefits`, `contraindication`, `brand`, `weight`, `type_of_state`, `desc`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `created_at`, `updated_at`) VALUES ('OxyElite', 'Termogênicos', 'Absorção Rápida De Carboidrato', 'Nenhum', 'Probiótica', '150 comprimidos', 'Comprimido', 'sdufhuaifh', 'oxyelite-usplabs.jpg', 'image/jpeg', 87823, '2015-11-23 12:28:27', '2015-11-23 12:28:27', '2015-11-23 12:28:27')

  def destroy
    #DELETE FROM products WHERE id = id
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 3

  def update
    # UPDATE
    @product = Product.find(params[:id])

    photo = params[:product][:photo]
    if photo.blank?
      photo = @product.photo
    end

    product_flavors = ProductFlavor.where("product_id = ?", @product.id)
    product_flavors.each do |pf|
      pf.delete
    end

    flavors = params[:flavors][:ids_flavors]

    flavors.each { |id|
      if id != "" && id != "0"
        product_flavor = ProductFlavor.new
        product_flavor.product = @product
        product_flavor.flavor = Flavor.find(id)
        product_flavor.save
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `weight` = '1000 cápsula', `type_of_state` = 'Cápsula', `photo_updated_at` = '2015-11-23 12:13:05', `photo_file_name` = '168-0012-962_detalhe1.jpg', `updated_at` = '2015-11-23 12:13:05' WHERE `products`.`id` = 2

  def find_products
    @products = Product.where("name LIKE ?", "%#{params[:search]}%")
---
SELECT `products`.* FROM `products` WHERE (name LIKE '%Wh%')