app/controllers/product_suggestions_controller.rb

SELECT `product_suggestions`.* FROM `product_suggestions` WHERE `product_suggestions`.`store_id` = 2
---
	def index_suggestions_of_store
		@products_suggestions = ProductSuggestion.where(store_id: current_store.id)

SELECT `product_suggestions`.* FROM `product_suggestions`
---
	def index
		@products_suggestions = ProductSuggestion.all

SELECT  `product_suggestions`.* FROM `product_suggestions` WHERE `product_suggestions`.`id` = 7 LIMIT 1
---
	def show
		begin
	      @product_suggestion = ProductSuggestion.find(params[:id])

INSERT INTO `product_suggestions` (`name`, `brand`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `status`, `store_id`) VALUES ('Novo Produto', 'Alguma Aeh', '168-0012-962_detalhe1.jpg', 'image/jpeg', 28064, '2015-11-22 18:59:18', 'Aguardando Análise Do Adminstrador!', 2)
---
	def create
		@product_suggestion = ProductSuggestion.new(name: params[:product_suggestion][:name],
													brand: params[:product_suggestion][:brand],
													photo: params[:product_suggestion][:photo],
													status: "Aguardando Análise Do Adminstrador!")
		@product_suggestion.store = current_store
		if @product_suggestion.save

SELECT  `product_suggestions`.* FROM `product_suggestions` WHERE `product_suggestions`.`id` = 7 LIMIT 1
---
	def edit
		begin
	      @product_suggestion = ProductSuggestion.find(params[:id])

SELECT  `product_suggestions`.* FROM `product_suggestions` WHERE `product_suggestions`.`id` = 6 LIMIT 1
DELETE FROM `product_suggestions` WHERE `product_suggestions`.`id` = 6
---
	def destroy
	    #DELETE FROM products WHERE id = id
	    @product_suggestion = ProductSuggestion.find(params[:id])
	    @product_suggestion.destroy