app/controllers/sale_client_controller.rb

SELECT `sales`.* FROM `sales` WHERE `sales`.`client_id` = 2
---
	def index
		@sales_client = Sale.where(client_id: params[:client_id])

SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
INSERT INTO `sales` (`total_value`, `status`, `delivery_value`, `delivery_limit`, `store_id`, `address_id`, `form_of_payment_id`, `client_id`, `created_at`, `updated_at`) VALUES (79.9, 'Aguardando Envio Pela Loja', 11.0, '8 mins', 1, 3, 6, 1, '2015-11-28 17:09:38', '2015-11-28 17:09:38')
INSERT INTO `sale_products` (`price`, `product_id`, `quantity`, `sale_id`, `created_at`, `updated_at`) VALUES (79.9, 1, 1, 2, '2015-11-28 17:09:38', '2015-11-28 17:09:38')
---
	def create
		status = "Aguardando Envio Pela Loja"
		@store = Store.find(params[:sale][:store_id])
		@sale_client = current_client_json.sales.new(total_value: params[:sale][:total_value],
								status: status,
								delivery_value: params[:sale][:delivery_value],
								delivery_limit: params[:sale][:delivery_limit],
								store_id: params[:sale][:store_id],
								address_id: params[:sale][:address_id],
								form_of_payment_id: params[:sale][:form_of_payment_id],
								change: params[:sale][:change])
		if @sale_client.save
			products_store = params[:store_products]
			products_store.each { |product_store|
				sale_product = @sale_client.sale_products.new(price: product_store[:price],
															  product_id: product_store[:product_id],
															  quantity: product_store[:quantity])
				sale_product.save