app/controllers/sale_store_controller.rb

	def show
		begin
	      @sale = Sale.find(params[:id])
---
SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1

	def index
		@status = params[:status]
		@month = params[:month]
		@year = params[:year]
		list_date = Sale.where(store_id: current_store.id, status: @status).order("created_at").select("id, created_at")
		@first_date = list_date.first
---
SELECT  id, created_at FROM `sales` WHERE `sales`.`store_id` = 1 AND `sales`.`status` = 'Aguardando Envio Pela Loja'  ORDER BY created_at LIMIT 1
SELECT `sales`.* FROM `sales` WHERE (store_id = 1 AND status = 'Aguardando Envio Pela Loja' AND MONTH(created_at) = '11' AND YEAR(created_at) = '2015')

	def update_with_status
		@sale_store = Sale.find(params[:sale][:id])
		status = ""
		@store = Store.find(@sale_store.store_id)
		if current_store != @store
			redirect_to sale_store_index_path(status:@sale_store.status, month:Time.now.month, year:Time.now.year), alert: "Essa venda não é sua"
			return
		end
		count_confirmed_purchases = @store.count_confirmed_purchases
		if @sale_store.status == "Aguardando Envio Pela Loja"
			status = "Aguardando Loja Confirmar Entrega"
		elsif @sale_store.status == "Aguardando Loja Confirmar Entrega"
			status = "Venda Concluída"
		else
			redirect_to sale_store_index_path(status:"Aguardando Envio Pela Loja", month:Time.now.month, year:Time.now.year), alert: "Esse status não existe"
			return
		end
		count_confirmed_purchases+=1
		if @sale_store.update(status: status)
---
SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1  ORDER BY `stores`.`id` ASC LIMIT 1
UPDATE `sales` SET `status` = 'Aguardando Loja Confirmar Entrega', `updated_at` = '2015-11-23 16:15:40' WHERE `sales`.`id` = 1
UPDATE `stores` SET `stores`.`count_confirmed_purchases` = 1 WHERE `stores`.`id` = 1

	def cancel_sale_store
		@sale_store = Sale.find(params[:sale][:id])
		@store = Store.find(@sale_store.store_id)
		if current_store != @store
			redirect_to sale_store_index_path(status:@sale_store.status, month:Time.now.month, year:Time.now.year), alert: "Essa venda não é sua"
			return
		end

		if params[:sale][:motivation] == nil
			respond_to do |format|
  				format.html {redirect_to sale_store_path(id: @sale_store.id), alert: "Para Cancelar Venda Necessita De Um Motivo!"}
  				format.json {render json: { errors: "Para Cancelar Venda Necessita De Um Motivo!"}}
			end
			return
		end

		count_canceled_purchases = @store.count_canceled_purchases
		if @sale_store.status == "Aguardando Loja Confirmar Entrega"
			count_canceled_purchases+=1
		end
		if @sale_store.update(status: "Venda Cancelada Pela Loja")
---
SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1  ORDER BY `stores`.`id` ASC LIMIT 1
UPDATE `sales` SET `status` = 'Venda Cancelada Pela Loja', `updated_at` = '2015-11-23 16:18:02' WHERE `sales`.`id` = 1
UPDATE `stores` SET `stores`.`count_canceled_purchases` = 1 WHERE `stores`.`id` = 1