app/controllers/sales_controller.rb

	def index
		@status = params[:status]
		@month = params[:month]
		@year = params[:year]
		@store_id = params[:store_id]
		list_date = Sale.where(store_id: @store_id, status: @status).order("created_at").select("id, created_at")
		@first_date = list_date.first
---
SELECT  id, created_at FROM `sales` WHERE `sales`.`status` = 'Aguardando Envio Pela Loja' AND `sales`.`store_id` IS NULL  ORDER BY created_at LIMIT 1
SELECT `sales`.* FROM `sales` WHERE (store_id = NULL AND status = 'Venda Concluída' AND MONTH(created_at) = '11' AND YEAR(created_at) = '2015')