app/controllers/store_products_controller.rb

  def index
    @on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now).destroy_all
    if current_store != nil
  	  @store_products = current_store.store_products
    elsif params[:store_id] != nil
      begin
        @store = Store.find(params[:store_id])
      rescue ActiveRecord::RecordNotFound => e
        @store = nil
      end
      if @store == nil
        respond_to do |format|
          format.html {redirect_to stores_path, alert: "Não existe loja com esse id!"}
          format.json {render json: @store_products.map {|s| [loja_produto: s.attributes, produto: s.product, loja: s.store]}}
        end
        return
      end
      @store_products = Store.find(params[:store_id]).store_products
    end
    respond_to do |format|
      format.html
      format.json {render json: @store_products.map {|s| [loja_produto: s.attributes, produto: s.product, loja: s.store]}}
---
DELETE FROM `on_sale_percentages` WHERE (date_limit < '2015-11-23 12:42:13.875099')
SELECT `on_sale_percentages`.* FROM `on_sale_percentages` WHERE (date_limit < '2015-11-22 14:25:50.998863')
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1  ORDER BY `stores`.`id` ASC LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `store_products`.* FROM `store_products` WHERE `store_products`.`on_sale_percentage_id` = 5
SELECT  `on_sale_percentages`.* FROM `on_sale_percentages` WHERE `on_sale_percentages`.`id` = 1 LIMIT 1

  def new
  	@store_product = StoreProduct.new
  	@products = Product.all.compact
    current_store.store_products.each do |store_product|
---
SELECT `products`.* FROM `products`
SELECT `store_products`.* FROM `store_products` WHERE `store_products`.`store_id` = 1

  def create
    #INSERT INTO
    @product = Product.find(Integer(params[:store_product][:id]))
    price = params[:store_product][:price]
    if price.count(',') > 0
      price[","] = "."
    end
    if price.count('R$ ') > 0
      price["R$ "] = ""
    end
    @store_product = current_store.store_products.new(price: price,
                                                      product_id: params[:store_product][:product_id],
                                                      store_id: current_store.id)
    @store_product.product = @product
    if @store_product.save
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
INSERT INTO `store_products` (`price`, `store_id`, `product_id`, `created_at`, `updated_at`) VALUES (500.0, 1, 2, '2015-11-22 18:50:29', '2015-11-22 18:50:29')

  def destroy
    #DELETE FROM products WHERE id = id
    @store_product = StoreProduct.find(params[:id])
    if @store_product.destroy
---
SELECT  `store_products`.* FROM `store_products` WHERE `store_products`.`id` = 1 LIMIT 1
DELETE FROM `store_products` WHERE `store_products`.`id` = 1

  def find_store_products
    @all_store_products = StoreProduct.where("product_id = ?", params[:product_id])

    @store_products = []

    @all_store_products.each do |store_product|
      store = Store.where("id = ? AND active = ?", store_product.store_id, true).first
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT  `store_products`.* FROM `store_products` WHERE (product_id = '1' AND store_id = SELECT `stores`.* FROM `stores` WHERE (id = 1 AND active = 1))  ORDER BY `store_products`.`id` ASC LIMIT 1
SELECT  `stores`.* FROM `stores` WHERE (id = 1 AND active = 1)  ORDER BY `stores`.`id` ASC LIMIT 1

  def find_store_product_withs_ids
    @on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now).destroy_all
---
SELECT `on_sale_percentages`.* FROM `on_sale_percentages` WHERE (date_limit < '2015-11-23 20:28:50.611214')

  def find_more_valuable_products
    @on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now).destroy_all

    country = params[:country]
    state = params[:state]
    city = params[:city]

    user_latitude = params[:latitude]
    user_longitude = params[:longitude]

    @store_products = Array.new
    all_store_products = Array.new

    if country != nil
      if state != nil
        if city != nil
          all_store_products = StoreProduct.joins(:store => :address).where(addresses:{country:country,state:state,city:city},stores:{active:true}).limit(10)
        else
          all_store_products = StoreProduct.joins(:store => :address).where(addresses:{country:country,state:state},stores:{active:true}).limit(10)
        end
      else
        all_store_products = StoreProduct.joins(:store => :address).where(addresses:{country:country},stores:{active:true}).limit(10)
      end
    end

    all_store_products.each do |store_product|
---
SELECT  `store_products`.* FROM `store_products` INNER JOIN `stores` ON `stores`.`id` = `store_products`.`store_id` INNER JOIN `addresses` ON `addresses`.`store_id` = `stores`.`id` WHERE `stores`.`active` = 1 AND `addresses`.`country` = 'Brasil' AND `addresses`.`state` = 'CE' AND `addresses`.`city` = 'Fortaleza' LIMIT 10
SELECT `stores`.* FROM `stores` INNER JOIN `addresses` ON `addresses`.`store_id` = `stores`.`id` WHERE `addresses`.`country` = 'Brasil' AND `addresses`.`state` = 'CE' AND `addresses`.`city` = 'Fortaleza' AND `stores`.`active` = 1
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 2 LIMIT 1

      end
    end

    render json: @store_products.map {|sp| [store_product: sp.attributes, product: sp.product.attributes, product_photo: sp.product.photo, store: sp.store.attributes, store_photo: sp.store.photo, address: Address.find_by_store_id(sp.store.id), on_sale_percentage: sp.on_sale_percentage, forms_of_payment_of_store: sp.store.form_of_payment_of_stores.map { |fps| {form_of_payment: FormOfPayment.find(fps.form_of_payment_id)} }]}
---
SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 2