app/controllers/stores_controller.rb

SELECT `on_sale_percentages`.* FROM `on_sale_percentages` WHERE (date_limit < '2015-11-22 18:42:13.999395')
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 1 LIMIT 1
SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1
SELECT `store_products`.* FROM `store_products` WHERE `store_products`.`store_id` = 1
---
  def show
    @on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now)
    @on_sale_percentages.each do |on_sale_percentage|
      on_sale_percentage.destroy
    end
    begin
      @store = Store.find(params[:id])
    rescue ActiveRecord::RecordNotFound => e
      @store = nil
    end
    if @store == nil
      respond_to do |format|
        format.html {redirect_to stores_path, alert: "Não existe loja com esse id!"}
        format.json {render json: {store: @store.store_products.map {|sp| [store_product: sp.attributes, product: sp.product.attributes, product_photo: sp.product.photo, store: @store.attributes, store_photo: @store.photo, on_sale_percentage: sp.on_sale_percentage, address: Address.find_by_store_id(@store.id) ]}, forms_of_payment_of_store: @store.form_of_payment_of_stores.map { |fps| {form_of_payment: FormOfPayment.find(fps.form_of_payment_id)} } }}

SELECT `stores`.* FROM `stores` WHERE (active = 0)
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 1 LIMIT 1
SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1
SELECT `store_products`.* FROM `store_products` WHERE `store_products`.`store_id` = 1
---
  def index
    @store = Store.new
    @storesNotActive = Store.where("active = ?", false)
    @storesActive = Store.where("active = ?", true)

  	respond_to do |format|
  		format.html
  		format.json {render json: @storesActive.map {|s| [store: s.attributes, store_photo: s.photo, store_products: s.store_products, address: Address.find_by_store_id(s.id), forms_of_payment_of_store: s.form_of_payment_of_stores.map { |fps| [form_of_payment: FormOfPayment.find(fps.form_of_payment_id)] }]}}

SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
UPDATE `stores` SET `stores`.`active` = 1 WHERE `stores`.`id` = 1
---
  def update_column_active
    @store = Store.find(params[:store][:id])
    if @store.active == true
      if @store.update_columns(active: false)

SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1
DELETE FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`id` = 12
SELECT  `form_of_payments`.* FROM `form_of_payments` WHERE `form_of_payments`.`id` = 1 LIMIT 1
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1  ORDER BY `stores`.`id` ASC LIMIT 1
INSERT INTO `form_of_payment_of_stores` (`form_of_payment_id`, `store_id`, `created_at`, `updated_at`) VALUES (1, 1, '2015-11-23 13:25:44', '2015-11-23 13:25:44')
---
  def update_forms_of_payments_of_store
    @store = current_store
    @store.form_of_payment_of_stores.each do |form_of_payment_of_store|
      form_of_payment_of_store.destroy
    end
    ids_forms_of_payment = params[:form_of_payment_of_stores][:ids_forms_of_payment]
    ids_forms_of_payment.each { |id|
      if id != "" and id != "0"
        form_of_payment_of_store = FormOfPaymentOfStore.new
        form_of_payment_of_store.form_of_payment = FormOfPayment.find(id)
        form_of_payment_of_store.store = @store
        form_of_payment_of_store.save

SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 3 LIMIT 1
---
  def update_address_of_store
    @store = current_store
    country = "Brasil"
    state = params[:address][:state]
    city = params[:address][:city]
    district = params[:address][:district].split.map(&:capitalize).join(' ')

UPDATE `addresses` SET `city` = 'Maracanaú', `full_address` = '314 31 Jereissati 1, Maracanaú, CE 61900-570, Brasil', `latitude` = -3.8796767, `longitude` = -38.6091475, `updated_at` = '2015-11-28 18:29:54' WHERE `addresses`.`id` = 5
---
      return
    end
    @address = @store.address
    if @address.update(country: country, state: state,
                        city: city, district: district,
                        street: street, number: number,
                        cep: cep, complement: complement,
                        full_address: full_address, latitude: latitude, longitude: longitude)

SELECT `stores`.* FROM `stores` WHERE (name LIKE '%Jsk%' AND active = 1)
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`store_id` = 1 LIMIT 1
SELECT `form_of_payment_of_stores`.* FROM `form_of_payment_of_stores` WHERE `form_of_payment_of_stores`.`store_id` = 1
SELECT `store_products`.* FROM `store_products` WHERE `store_products`.`store_id` = 1
---
  def find_stores
    @stores = Store.where("name LIKE ? AND active = ?", "%#{params[:search]}%", true)

    respond_to do |format|
      format.json {render json: { store: @stores.map {|s| [store: s.attributes, store_photo: s.photo, store_products: s.store_products, address: Address.find_by_store_id(s.id),  forms_of_payment_of_store: s.form_of_payment_of_stores.map { |fps| {form_of_payment: FormOfPayment.find(fps.form_of_payment_id)} }]}}}

SELECT `stores`.* FROM `stores` INNER JOIN `addresses` ON `addresses`.`store_id` = `stores`.`id` WHERE `addresses`.`country` = 'Brasil' AND `addresses`.`state` = 'CE' AND `addresses`.`city` = 'Fortaleza' AND `stores`.`active` = 1
---
  def find_nearest_stores
    country = params[:country]
    state = params[:state]
    city = params[:city]
    @stores = Array.new
    if country != nil
      if state != nil
        if city != nil
          @stores = Store.joins(:address).where(addresses:{country:country,state:state,city:city},stores:{active:true})