app/controllers/store_products_controller.rb

SELECT `store_products`.* FROM `store_products` INNER JOIN `stores` ON `stores`.`id` = `store_products`.`store_id` INNER JOIN `addresses` ON `addresses`.`store_id` = `stores`.`id` WHERE `stores`.`active` = 1 AND `addresses`.`country` = 'Brasil' AND `addresses`.`state` = 'CE' AND `addresses`.`city` = 'Fortaleza'  ORDER BY `store_products`.`price` DESC
---
  def find_more_valuable_products
    @on_sale_percentages = OnSalePercentage.where("date_limit < ?", Time.now)
    @on_sale_percentages.each do |on_sale_percentage|
      on_sale_percentage.destroy
    end
    country = params[:country]
    state = params[:state]
    city = params[:city]
    @store_products = Array.new
    if country != nil
      if state != nil
        if city != nil
          @store_products = StoreProduct.joins(:store => :address).where(addresses:{country:country,state:state,city:city},stores:{active:true}).order(price: :desc)