app/controllers/stores/registrations_controller.rb

INSERT INTO `stores` (`name`, `name_responsible`, `cnpj`, `instagram`, `facebook`, `site`, `telephone`, `delivery`, `email`, `encrypted_password`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `value_per_km`, `created_at`, `updated_at`, `auth_token`) VALUES ('Aron Uchoa', 'Aron', '31.879.317/3891-23', 'arondossuplementos', 'arondossuplementos', 'www.arondossuplementos.com', '(89)27349-8237', 1, 'aron@gmail.com', '$2a$10$TCovmxhZ7a82SE0GIWed7eYO/UXT02rPbzD9BZ6I9TKBF7a0OltJ6', 'nutriforma-home.jpg', 'image/jpeg', 730624, '2015-11-22 18:56:57', 5.0, '2015-11-22 18:56:57', '2015-11-22 18:56:57', 'tp6tFMAsEdtkSTF3gQ1y')
INSERT INTO `addresses` (`country`, `state`, `city`, `district`, `street`, `number`, `cep`, `complement`, `full_address`, `latitude`, `longitude`, `store_id`, `created_at`, `updated_at`) VALUES ('Brasil', 'CE', 'Fortaleza', 'Montese', 'Rua Alberto Magno', '150', '60444-444', '', '150 Rua Alberto Magno Montese, Fortaleza, CE 60444-444, Brasil', -3.7576963, -38.5437625, 2, '2015-11-22 18:56:57', '2015-11-22 18:56:57')
---
                        cep: cep, complement: complement,
                        full_address: full_address, latitude: latitude, longitude: longitude)

    if @store.save
      @address.store_id = @store.id
      @address.save

SELECT  `form_of_payments`.* FROM `form_of_payments` WHERE `form_of_payments`.`id` = 1 LIMIT 1
---
      ids_forms_of_payment.each { |id|
        if id != "" and id != "0"
          form_of_payment_of_store = FormOfPaymentOfStore.new
          form_of_payment_of_store.form_of_payment = FormOfPayment.find(id)